<a href="https://colab.research.google.com/github/sbj6364/python-study/blob/main/25_aggregating3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 25번 : aggregating (3)

다음 데이터에서 주어진 DataFrame을 만드세요.

생성된 DataFrame에서 label A와 label B를 기준으로 val1, val2, val3의 합계를 구하는 코드를 작성해보세요.




#### 데이터
~~~
	val1 val2 val3 label
0	1	-1	2	A
1	2	-2	3	A
2	3	-3	4	B
3	4	-4	7	B
4	5	-5	8	B
~~~
#### output 참고
[FutureSkill 25](https://futureskill.io/content/903ab63c-2b24-4be0-ba1c-a3ba34dce258/question/43010a2c-8313-4e1b-bf5f-b1af7b149e38)

In [2]:
import pandas as pd
import numpy as np

ar = [[1,-1,2],
      [2,-2,3],
      [3,-3,4],
      [4,-4,7],
      [5,-5,8]]
label = ['A','A','B','B','B']

df = pd.DataFrame(ar, columns=['val1','val2','val3'])
df['label'] = label
df

   val1  val2  val3 label
0     1    -1     2     A
1     2    -2     3     A
2     3    -3     4     B
3     4    -4     7     B
4     5    -5     8     B

In [28]:
dfg = df.groupby(label)
pd.DataFrame(dfg.agg('sum'))

   val1  val2  val3
A     3    -3     5
B    12   -12    19

In [30]:
dfg = df.groupby(label).sum()
dfg

   val1  val2  val3
A     3    -3     5
B    12   -12    19